//
// workbook-02.js
// 問題番号：10 ~ 14
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q10 = () => {
  // ----------------------------------------
  // 10. 0 or not 0
  // ----------------------------------------
  console.log(`10. 整数を入力して、その値が 0 なら「 ZERO 」、0 でなければ「 not ZERO 」とコンソールに表示する`);

  let num = parseInt(prompt(`Q10. 数値を入力`));
  if (num == 0) {
    console.log("ZERO");
  }
  else {
    console.log("not ZERO");
  }


}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->


const q11 = () => {
  // ----------------------------------------
  // 11. 都道府県番号検索
  // ----------------------------------------
  console.log(`11. 都道府県番号を入力し、その値に該当する都道府県名をコンソールに表示する`);

  let num = parseInt(prompt(`Q11. 都道府県番号を入力`));

  if (num == 25) {
    console.log("滋賀県");
  }
  else if (num == 26) {
    console.log("京都府");
  }
  else if (num == 27) {
    console.log("大阪府");
  }
  else if (num == 28) {
    console.log("兵庫県");
  }
  else if (num == 29) {
    console.log("奈良県");
  }
  else if (num == 30) {
    console.log("和歌山県");
  }
  else {
    console.log("該当なし");
  }
}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->


const q12 = () => {
  // ----------------------------------------
  // 12. 奇数 or 偶数
  // ----------------------------------------
  console.log(`12. 整数を入力し、その値が偶数なら「 even 」、奇数ならば「 odd 」とコンソールに表示する`);

  let num = parseInt(prompt(`Q12. 整数を入力`));

  if (num % 2 == 0) {
    console.log("偶数です");
  }
  else {
    console.log("奇数です");
  }

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->


const q13 = () => {
  // ----------------------------------------
  // 13. 入園料の計算
  // ----------------------------------------
  console.log(`13. 入園人数を入力して、その入園料金をコンソールに表示する\r\n入園料：１人８００円、５人以上のグループなら１人７６０円、２０人以上の団体なら１人５００円`);

  let num = parseInt(prompt(`Q13. 入園者数を入力`));
  let price = 800;
  let price1 = 760;
  let price2 = 500;

  if (num < 5) {
    console.log(price * num + "円");
  }
  else if (num < 20) {
    console.log(price1 * num + "円");
  }
  else if (num >= 20) {
    console.log(price2 * num + "円");
  }


}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->


const q14 = () => {
  // ----------------------------------------
  // 14. 成績評価判定
  // ----------------------------------------
  console.log(`14. 出席率と評価点を入力し、A ~ Fの評価判定結果をコンソールに表示する\r\n評価判定は、出席率７５％以上 かつ \r\n評価点90~100：A\r\n評価点80~89：B\r\n評価点70~79：C\r\n評価点60~69：D\r\n評価点60未満：F\r\n出席率が75%未満の場合は、評価点に関わらず判定はF`);

  let num1 = parseInt(prompt(`Q14. 出席率の入力`));
  let num2 = parseInt(prompt(`Q14. 評価点の入力`));

  console.log(`出席率:${num1}`);
  console.log(`評価点:${num2}`);

  if (num1 < 75) {
    console.log("F");
  }
  else if (num2 < 60) {
    console.log("F");
  }
  else if (num2 < 69) {
    console.log("D");
  }
  else if (num2 < 79) {
    console.log("C");
  }
  else if (num2 < 89) {
    console.log("B");
  }
  else if (num2 <= 100) {
    console.log("A");
  }


}
