
//
// workbook-03.js
// 問題番号：15 ~ 19
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q15 = () => {
  // ----------------------------------------
  // 15. メッセージ表示の回数指定
  // ----------------------------------------
  console.log(`15. 数値を入力し、その値回数「 Hello World! 」をコンソールに表示する`);

  let num = parseInt(prompt(`Q15. 表示する回数を入力`));

  for (let i = 0; i < num; i++) {
    console.log("Hello World!");
  }

}

const q16 = () => {
  // ----------------------------------------
  // 16. 終了ワードまで繰り返す
  // ----------------------------------------
  console.log(`16. キーワードを入力しコンソールに表示する\r\nもし、キーワードに「 end 」が入力されたら、キーワード入力を終了する`);

  // console.log(result);

  do {
    let result = prompt(`Q16. キーワードを入力`);

    if (result == "end") {
      console.log("ループ終了");
      break;
    }

    console.log("キーワード", result);
  } while (true);

}

const q17 = () => {
  // ----------------------------------------
  // 17. FazzBazz
  // ----------------------------------------
  console.log(`17. 1 ~ 100までの値を繰り返しコンソールに表示する。\r\nもし、値が3の倍数の時は「 Fazz 」と表示し、\r\n5の倍数の時は「 Bazz 」と表示し、\r\n3と5の倍数の時は「FazzBazz」と表示する。`);

  // let count = 0
  // do {
  //   count++

  //   if (count % 3 == 0) {
  //     count = "Fazz";
  //     break
  //   }
  //   else if (count % 5 == 0) {
  //     count = "Bazz";
  //     break
  //   }
  //   console.log(count);
  // } while (count <= 100)



  for (let i = 1; i <= 100; i++) {
    if (i % 15 == 0) {
      console.log("FazzBazz");
    }
    else if (i % 3 == 0) {
      console.log("Fazz");
    }
    else if (i % 5 == 0) {
      console.log("Bazz");
    }
    else {
      console.log(i);
    }
  }


  const q18 = () => {
    // ----------------------------------------
    // 18. 九九の表
    // ----------------------------------------
    console.log(`18. 九九の表をコンソールに表示する`);




  }


  const q19 = () => {
    // ----------------------------------------
    // 19. 基数変換
    // ----------------------------------------
    console.log(`19. 10進数の値から2進数の値へ基数変換する`);

    prompt(`Q19. 1以上の好きな正の整数を入力`);





  }

}
