//
// workbook-01.js
// 問題番号：01 ~ 09
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q01 = () => {
  // ----------------------------------------
  // 01. 「Hello World!」を表示する
  // ----------------------------------------
  console.log(`01. 「 Hello World! 」を表示する`);
  console.log("Hello World!");





};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q02 = () => {
  // ----------------------------------------
  // 02. 「EC」と「C」を連結して「ECC」を表示する
  // ----------------------------------------
  console.log(`02. 「 EC 」と「 C 」を連結して「ECC」を表示する`);
  console.log("EC" + "C");





}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q03 = () => {
  // ----------------------------------------
  // 03. データの入力と表示
  // ----------------------------------------
  console.log(`03. 好きなメッセージを入力し、コンソールに表示する`);
  console.log(prompt(`Q03. メッセージを入力`));


}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q04 = () => {
  // ----------------------------------------
  // 04. ２つの数値を入力して、その合計を表示する
  // ----------------------------------------
  console.log(`04. ２つの数値を入力して、その合計を表示する`);

  let prompt1 = parseInt(prompt(`Q04. １つ目の数値を入力`));
  let prompt2 = parseInt(prompt(`Q04. ２つ目の数値を入力`));
  let num = prompt1 + prompt2;
  console.log(num);
  console.log(`${prompt1} + ${prompt2} = ${num}`);

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q05 = () => {
  // ----------------------------------------
  // 05. ２つの数値を入力して、その余りを表示する
  // ----------------------------------------
  console.log(`05. ２つの数値を入力して、その余りを表示する`);

  let prompt1 = parseInt(prompt(`Q05. １つ目の数値を入力`));
  let prompt2 = parseInt(prompt(`Q05. ２つ目の数値を入力`));
  let num = prompt1 % prompt2;
  console.log(`${prompt1} ÷　${prompt2}のあまりは${num}`);

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q06 = () => {
  // ----------------------------------------
  // 06. 2つの整数値を入力して、その和・差・積・商と余りを表示する
  // ----------------------------------------
  console.log(`06. 2つの整数値を入力して、その和・差・積・商・余を表示する`);

  let prompt1 = parseInt(prompt(`Q06. １つ目の数値を入力`));
  let prompt2 = parseInt(prompt(`Q06. ２つ目の数値を入力`));

  let wa = prompt1 + prompt2;
  let sa = prompt1 - prompt2;
  let seki = prompt1 * prompt2;
  let jo = prompt1 / prompt2;

  console.log(`１つ目の数値:${prompt1}`);
  console.log(`2つ目の数値:${prompt2}`);

  console.log(`和:${wa} `);
  console.log(`差:${sa} `);
  console.log(`積:${seki} `);
  console.log(`除:${jo} `);

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q07 = () => {
  // ----------------------------------------
  // 07. 消費税の計算
  // ----------------------------------------
  console.log(`07. 金額と消費税率を入力して、消費税の金額をコンソールに表示する`);

  let prompt1 = parseInt(prompt(`Q07. 金額を入力`));
  let prompt2 = parseInt(prompt(`Q07. 消費税率を入力（%）`));
  let tax = prompt1 / prompt2;
  console.log(`金額:${prompt1}`);
  console.log(`税額:${tax}`);

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q08 = () => {
  // ----------------------------------------
  // 08. 円の面積
  // ----------------------------------------
  console.log(`08. 半径を入力して、円の面積をコンソールに表示する`);

  let num1 = prompt(`Q08. 円の半径を入力`);
  let num2 = num1 * num1 * Math.PI;

  console.log(`円の半径:${num1}`);
  console.log(`円の面積:${num2}`);

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q09 = () => {
  //
  // 09. 小数点の桁数指定
  //
  console.log(`09. ２つの整数を入力して、その除算結果と小数点以下第２位までに丸めた結果をコンソールに表示する`);

  let prompt1 = parseInt(prompt(`Q09. １つ目の数値を入力`));
  let prompt2 = parseInt(prompt(`Q09. ２つ目の数値を入力`));
  let result1 = (prompt1 / prompt2);
  let result2 = (Math.floor(result1 * 100) / 100);

  console.log(`そのままの結果${result1}`);
  console.log(`小数点を丸めた結果${result2}`);

}

